{
	"trips": [
		{
			"trip": "Hanging Canyon",
			"location": "Grand Teton National Park, WY",
			"thumb": "/res/trips/hanging-canyon/thumb.jpg",
			"images": [
				"/res/trips/hanging-canyon/img1.jpg",
				"/res/trips/hanging-canyon/img2.jpg",
				"/res/trips/hanging-canyon/img3.jpg",
				"/res/trips/hanging-canyon/img4.jpg",
				"/res/trips/hanging-canyon/img5.jpg",
				"/res/trips/hanging-canyon/img6.jpg"
			],
			"description": "In the late spring of 2015, I made it out to Grand Teton National Park. At the recommendation of a parks employee, I paid a visit to Hanging Canyon - a beautiful glacial canyon overlooking Lake Jenny. A large amount of snow was left on the upper portion of the route, making it a great spring alpine ascent. I made it up to the actual canyon in about three hours but decided to cut my stay short. Originally planning on climbing up to the Jaw (the official end of Hanging Canyon), I ended up leaving prematurely due to deteriorating snow conditions."
		},
		{
			"trip": "Arches",
			"location": "Arches National Park, UT",
			"thumb": "/res/trips/arches/thumb.jpg",
			"images": [
				"/res/trips/arches/img1.jpg",
				"/res/trips/arches/img2.jpg",
				"/res/trips/arches/img3.jpg",
				"/res/trips/arches/img4.jpg",
				"/res/trips/arches/img5.jpg"
			],
			"description": "The desert's not my favorite place in the world, but when the chance to see Arches came up, I definitely wanted to stop. Not too much exploring besides driving around, taking a few photos and admiring the views."
		},
		{
			"trip": "Cascade Canyon",
			"location": "Grand Teton National Park, WY",
			"thumb": "/res/trips/cascade-canyon/thumb.jpg",
			"images": [
				"/res/trips/cascade-canyon/img1.jpg",
				"/res/trips/cascade-canyon/img2.jpg",
				"/res/trips/cascade-canyon/img3.jpg",
				"/res/trips/cascade-canyon/img4.jpg",
				"/res/trips/cascade-canyon/img5.jpg"
			],
			"description": "One of the many canyons in Teton National Park I visited during my spring trip. We stayed for two nights and ventured into the South Fork. At the time, the South Fork was still covered in a blanket of snow with drifts several feet deep."
		},
		{
			"trip": "Lawn Lake",
			"location": "Rocky Mountain National Park, CO",
			"thumb": "/res/trips/rocky-mountain/thumb.jpg",
			"images": [
				"/res/trips/rocky-mountain/img1.jpg",
				"/res/trips/rocky-mountain/img2.jpg",
				"/res/trips/rocky-mountain/img3.jpg",
				"/res/trips/rocky-mountain/img4.jpg"
			],
			"description": "A quick overnight visit to Lawn Lake in the northern section of Rocky Mountain National Park. Route finding was tricky as the trail all but disappeared in the deep snow on our way up. We had a nice tranquil night and were completely alone aside from the occasional marmot. Our first day was gorgeous, however our second day gave way to rain showers."
		},
		{
			"trip": "Glacier",
			"location": "Glacier Mountain National Park, MT",
			"thumb": "/res/trips/glacier/thumb.jpg",
			"images": [
				"/res/trips/glacier/img1.jpg",
				"/res/trips/glacier/img2.jpg",
				"/res/trips/glacier/img3.jpg",
				"/res/trips/glacier/img4.jpg",
				"/res/trips/glacier/img5.jpg",
				"/res/trips/glacier/img6.jpg",
				"/res/trips/glacier/img7.jpg"
			],
			"description": "A short day hike with a bit of snow trekking in the end. I do not recall the exact name or location of the trail, I just pulled out my map and started heading up. A steep but short hike up from the road gave way to expansive meadows, snowfields and some of the most breathtaking vistas I've encountered. It may be the most beautiful place I've ever been able to travel to, and certainly my favorite."
		},
		{
			"trip": "Lion Head",
			"location": "Mt. Washington, NH",
			"thumb": "/res/trips/lions-head/thumb.jpg",
			"images": [
				"/res/trips/lions-head/img1.jpg",
				"/res/trips/lions-head/img2.jpg",
				"/res/trips/lions-head/img3.jpg",
				"/res/trips/lions-head/img4.jpg"
			],
			"description": "A classic ascent up the Lion Head winter route to the summit of Mt. Washington. It was a beautiful day with low winds and around 10 inches of fresh snow. Small avalanches could be seen on the headwall of Tuckerman's as we skirted the northern ridge."
		},
		{
			"trip": "Sphinx Trail",
			"location": "Great Gulf Wilderness, NH",
			"thumb": "/res/trips/sphinx-trail/thumb.jpg",
			"images": [
				"/res/trips/sphinx-trail/img1.jpg",
				"/res/trips/sphinx-trail/img2.jpg",
				"/res/trips/sphinx-trail/img3.jpg",
				"/res/trips/sphinx-trail/img4.jpg"
			],
			"description": "A summer backpacking trip over the top of Mt. Washington and into the Great Gulf Wilderness. I took the Glen Boulder Trail up the southeast side of Mt. Washington and descended into the wilderness via Sphinx Trail. Some small patches of snow were still visible and had not yet melted out in the summer's heat."
		},
		{
			"trip": "Presidential Traverse",
			"location": "Great Gulf Wilderness, NH",
			"thumb": "/res/trips/presidential-traverse/thumb.jpg",
			"images": [
				"/res/trips/presidential-traverse/img1.jpg",
				"/res/trips/presidential-traverse/img2.jpg",
				"/res/trips/presidential-traverse/img3.jpg",
				"/res/trips/presidential-traverse/img4.jpg"
			],
			"description": "A classic traverse over some of the notable peaks of the White Mountains. Our trek took around three days in total from start to finish and covered the peaks from Washington to Madison. We ended our trip with a descent down Madison Gulf Trail which was certainly one of the more adventurous ways down I've taken. The trail consisted of large, steep granite slabs strewn about in what essentially could be called a stream."
		}
	]
}